#### Terraform Format and Style 🖌 `success` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.discord_simde.discord_role.treso has been changed
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 10 -> 11
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.member has been changed
  ~ resource "discord_role" "member" {
        id          = "759778776560828447"
        name        = "Vénéré membre"
      ~ position    = 3 -> 4
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.payutc has been changed
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 11 -> 12
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.woolly has been changed
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 6 -> 2
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.gesasso has been changed
  ~ resource "discord_role" "gesasso" {
        id          = "892342940226158603"
        name        = "Projet Gesasso"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.bde has been changed
  ~ resource "discord_role" "bde" {
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.admin has been changed
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 13 -> 14
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.etuville has been changed
  ~ resource "discord_role" "etuville" {
        id          = "886977202707648563"
        name        = "Etuville"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.emploidut has been changed
  ~ resource "discord_role" "emploidut" {
        id          = "814062042973339679"
        name        = "Emploi du temps"
      ~ position    = 4 -> 5
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.integ has been changed
  ~ resource "discord_role" "integ" {
        id          = "802911395758473247"
        name        = "Integ"
      ~ position    = 9 -> 10
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.jeffrey has been changed
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.respinfo has been changed
  ~ resource "discord_role" "respinfo" {
        id          = "781934406292996116"
        name        = "Elegant Resp Info"
      ~ position    = 2 -> 3
        # (6 unchanged attributes hidden)
    }
  # module.discord_simde.discord_role.zapier has been changed
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 12 -> 13
        # (6 unchanged attributes hidden)
    }
  # module.github.github_team_repository.simde_terraform has been changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"c32f88cd298b4903f6e764f184e1fa42a9005db40e23b0f0e1d51285d41d3e5f\"" -> "W/\"9a2d89f27333a67a9536457ebf5666f43e763f7bc6bef22236bc4e88460b61fd\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_role.bde will be updated in-place
  ~ resource "discord_role" "bde" {
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 6 -> 5
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.emploidut will be updated in-place
  ~ resource "discord_role" "emploidut" {
        id          = "814062042973339679"
        name        = "Emploi du temps"
      ~ position    = 5 -> 4
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.gesasso will be updated in-place
  ~ resource "discord_role" "gesasso" {
        id          = "892342940226158603"
        name        = "Projet Gesasso"
      ~ position    = 7 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.member will be updated in-place
  ~ resource "discord_role" "member" {
        id          = "759778776560828447"
        name        = "Vénéré membre"
      ~ position    = 4 -> 3
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.respinfo will be updated in-place
  ~ resource "discord_role" "respinfo" {
        id          = "781934406292996116"
        name        = "Elegant Resp Info"
      ~ position    = 3 -> 2
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.woolly will be updated in-place
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 2 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.module.guillaume_theunissen.discord_member_roles.member_role["892342940226158603"] will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "321975642684129293"

      + role {
          + has_role = true
          + role_id  = "892342940226158603"
        }
    }

  # module.discord_simde.module.leopold_chappuis.discord_member_roles.member_role["892342940226158603"] will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "359038397265870848"

      + role {
          + has_role = true
          + role_id  = "892342940226158603"
        }
    }

  # module.github.module.repositories.github_branch_protection.gesasso_mkultra_master will be created
  + resource "github_branch_protection" "gesasso_mkultra_master" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }
    }

  # module.github.module.repositories.github_repository.gesasso_mkultra will be created
  + resource "github_repository" "gesasso_mkultra" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "gesasso_mkultra"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkultra will be created
  + resource "github_team_repository" "gesasso_gesasso_mkultra" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkultra"
      + team_id    = "4673796"
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkultra will be created
  + resource "github_team_repository" "simde_gesasso_mkultra" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkultra"
      + team_id    = "4217733"
    }

Plan: 6 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*